vastness.org

#+TITLE: Vastness
#+AUTHOR: Rick Neff
#+EMAIL:  NeffR@byui.edu
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t

* EN11

You are invited to apply what you've learned to synthesize and analyze
an algorithm for solving a deceptively simple problem, vast in its
extent. This invitation to exploration is codenamed /Vastness/.

** Requirements

Write elisp code for solving the following problem:

Given a positive integer =n=, is there a power of 2 that has a
specified =n=-digit number as a prefix?

While simple to state, there are numerous questions this problem
raises, not the least of which is, is it tractable?  With certain
1-digit numbers (1 through 6, and 8) the answer is trivially yes, by
mere inspection of a few small powers of 2:

| Prefix | n | 2^n |
|--------+---+-----|
| 1      | 0 | 1   |
| 2      | 1 | 2   |
| 3      | 5 | 32  |
| 4      | 2 | 4   |
| 5      | 9 | 512 |
| 6      | 6 | 64  |
| 8      | 3 | 8   |

A program is certainly not needed to find those! And for the
single digits 7 and 9, a determined search will eventually find
$70368744177664 = 2^{46}$ and $9007199254740992 = 2^{53}$, which are
the smallest numbers that fit the bill. But what about 2-digit
numbers? 3-digit numbers? 4-digit numbers? 27-digit numbers?!

One of the goals of this class was for you to become conversant with
the topics and issues surrounding algorithms and complexity. Recall
that these included:

     - Basic algorithms analysis: Asymptotic analysis of upper and average complexity bounds.
     - Best, average, and worst case behaviors.
     - Big-Oh, little-Oh, Big-Omega, and Big-Theta notation.
     - Standard complexity classes.
     - Empirical measurements of performance.
     - Time and space tradeoffs in algorithms.

Together with the new patterns of thinking and mind tools you have
acquired throughout the semester, you should call upon for this
"capstone" exploration all of your prior intuition and creativity and
/curiosity/ --- so treat this as a superlative gersy principle
application opportunity!

** Introduction
   
   We were able to learn many things from this exploration about the importance

   of algorithms and understanding how they function. Throughout this exploration

   we will explore several different ideas with the questions, and then we will

   give the solution that we were able to find.

** Response to Questions


      1. What data structures are appropriate?

	 We used the data structures in calc eval

	 to hold the numbers so we did not have to worry about doing our own

	 big int.

      2. What algorithm design technique(s) is/are best.
	 
	 The best algorithm technique that we found was to reduce the exponential

	 calcluations into logarithmic calculations. We reduced the length of 

	 the calculations to ensure that the program could run much more efficiently.

      3. What form should your program's input and output take?

	 INPUT: A string of the prefix numbers that we were looking for in a power of 2
	 OUTPUT: the exponent of the power of 2 that gives us the matching prefix numbers.
 
      4. What is/are the efficiency/complexity class(es) of your algorithm(s)?
	 
	 Based on what we calculated from the function we produced the funtion was 

	 linear. But there could be complexity items in calc-eval that turned it

	 into an exponential function. 
	 
	 
         Lower bound is constant based on just putting in a 1 or any other power

	 of two.

	 We do not really know what the average bound is but, if we could guess

	 it will be close to the upper bound.

      5. What is the actual running time for some test runs?
	 
         "123456" 1m 28.585s
      
         "12345"     50.036s

         "1234"       2.258s

         "123"         .214s

         "12"          .071s

         "1"           .082s

      6. Is this decision problem NP-Complete?

	 Yes, because it is possible to find the problem in polynomial time. It might

	 take forever but it is possible.

      7. What problem sizes are feasible?

	 7 digit numbers are probably the highest feasible size because it can

	 be done in the most reasonable time of about 20 minutes.

      8. Is there hope of ever finding your "personal" power of 2, if
         it even exists? For example, the smallest power of 2 prefixed by
         your 9-digit ID number or 10-digit phone number? What about a
         27-digit number consisting of the 9 digits of your Social Security
         number, followed by the 8 digits of your birth date (2 for month, 2
         for day, 4 for year), followed by the 10 digits of your cell phone
         number?

	 There is hope, because it is an infinite number so somewhere out in 

	 existence. The algorithm we wrote would not be able to find it in a 

	 reasonable amount of time but, potentially some other algorithm or a 

	 faster computer or both could find the number in a reasonable amount of

	 time. Because it is a decision problem the answer is yes.

      9. What size of inputs can be computed in a reasonable amount of time?

	 Reasonable time is about 6 digit values or 2^n values.
 
      10. How did you increase the efficiency of the Algorithm?

	  We added a lower bound based on the number of digits and the 2^n value

	  that was just smaller or equal to that number of digits.

	  We pulled calcuations that repeated themselves out of the loop.

	  We also set calc-precision based on our input.

      11. What does a string do to the algorithm as opposed to a large integer?

	  The string adds complexity to the algorithm by making compare functions

	  have extra loops that then increase the complexity of the algorithm.

	  If the numbers are reasonably small an integer container would be better

	  suited to handle the calculation. As is a string is probably as efficient

	  as is possible for this situation.

      12. How does precision affect the calculation?

	  The precision of the calculation could determine how long each iteration took

	  which could then add greatly to the amount of time that it took for us

	  to calculate the final answer. The tradeoff was that precision could not

	  be too small or there would be rounding errors. In the end we had to 

	  keep a certain amount of precision that was ballanced in the end.

