vastness.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Vastness</title>
<!-- 2015-12-11 Fri 21:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Rick Neff" />
</head>
<body>
<div id="content">
<h1 class="title">Vastness</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">EN11</h2>
<div class="outline-text-2" id="text-1">
<p>
You are invited to apply what you've learned to synthesize and analyze
an algorithm for solving a deceptively simple problem, vast in its
extent. This invitation to exploration is codenamed <i>Vastness</i>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Write elisp code for solving the following problem:
</p>

<p>
Given a positive integer <code>n</code>, is there a power of 2 that has a
specified <code>n</code>-digit number as a prefix?
</p>

<p>
While simple to state, there are numerous questions this problem
raises, not the least of which is, is it tractable?  With certain
1-digit numbers (1 through 6, and 8) the answer is trivially yes, by
mere inspection of a few small powers of 2:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Prefix</th>
<th scope="col" class="right">n</th>
<th scope="col" class="right">2<sup>n</sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">1</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">5</td>
<td class="right">32</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">2</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">9</td>
<td class="right">512</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">64</td>
</tr>

<tr>
<td class="right">8</td>
<td class="right">3</td>
<td class="right">8</td>
</tr>
</tbody>
</table>

<p>
A program is certainly not needed to find those! And for the
single digits 7 and 9, a determined search will eventually find
\(70368744177664 = 2^{46}\) and \(9007199254740992 = 2^{53}\), which are
the smallest numbers that fit the bill. But what about 2-digit
numbers? 3-digit numbers? 4-digit numbers? 27-digit numbers?!
</p>

<p>
One of the goals of this class was for you to become conversant with
the topics and issues surrounding algorithms and complexity. Recall
that these included:
</p>

<ul class="org-ul">
<li>Basic algorithms analysis: Asymptotic analysis of upper and average complexity bounds.
</li>
<li>Best, average, and worst case behaviors.
</li>
<li>Big-Oh, little-Oh, Big-Omega, and Big-Theta notation.
</li>
<li>Standard complexity classes.
</li>
<li>Empirical measurements of performance.
</li>
<li>Time and space tradeoffs in algorithms.
</li>
</ul>

<p>
Together with the new patterns of thinking and mind tools you have
acquired throughout the semester, you should call upon for this
"capstone" exploration all of your prior intuition and creativity and
<i>curiosity</i> &#x2014; so treat this as a superlative gersy principle
application opportunity!
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Introduction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We were able to learn many things from this exploration about the importance
</p>

<p>
of algorithms and understanding how they function. Throughout this exploration
</p>

<p>
we will explore several different ideas with the questions, and then we will
</p>

<p>
give the solution that we were able to find.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Response to Questions</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>What data structures are appropriate?

<p>
We used the data structures in calc eval
</p>

<p>
to hold the numbers so we did not have to worry about doing our own
</p>

<p>
big int.
</p>
</li>

<li>What algorithm design technique(s) is/are best.

<p>
The best algorithm technique that we found was to reduce the exponential
</p>

<p>
calcluations into logarithmic calculations. We reduced the length of 
</p>

<p>
the calculations to ensure that the program could run much more efficiently.
</p>
</li>

<li>What form should your program's input and output take?

<p>
INPUT: A string of the prefix numbers that we were looking for in a power of 2
OUTPUT: the exponent of the power of 2 that gives us the matching prefix numbers.
</p>
</li>

<li>What is/are the efficiency/complexity class(es) of your algorithm(s)?

<p>
Based on what we calculated from the function we produced the funtion was 
</p>

<p>
linear. But there could be complexity items in calc-eval that turned it
</p>

<p>
into an exponential function. 
</p>
</li>
</ol>


<p>
Lower bound is constant based on just putting in a 1 or any other power
</p>

<p>
of two.
</p>

<p>
We do not really know what the average bound is but, if we could guess
</p>

<p>
it will be close to the upper bound.
</p>

<ol class="org-ol">
<li>What is the actual running time for some test runs?

<p>
"123456" 1m 28.585s
</p>

<p>
"12345"     50.036s
</p>

<p>
"1234"       2.258s
</p>

<p>
"123"         .214s
</p>

<p>
"12"          .071s
</p>

<p>
"1"           .082s
</p>
</li>

<li>Is this decision problem NP-Complete?

<p>
Yes, because it is possible to find the problem in polynomial time. It might
</p>

<p>
take forever but it is possible.
</p>
</li>

<li>What problem sizes are feasible?

<p>
7 digit numbers are probably the highest feasible size because it can
</p>

<p>
be done in the most reasonable time of about 20 minutes.
</p>
</li>

<li>Is there hope of ever finding your "personal" power of 2, if
it even exists? For example, the smallest power of 2 prefixed by
your 9-digit ID number or 10-digit phone number? What about a
27-digit number consisting of the 9 digits of your Social Security
number, followed by the 8 digits of your birth date (2 for month, 2
for day, 4 for year), followed by the 10 digits of your cell phone
number?

<p>
There is hope, because it is an infinite number so somewhere out in 
</p>

<p>
existence. The algorithm we wrote would not be able to find it in a 
</p>

<p>
reasonable amount of time but, potentially some other algorithm or a 
</p>

<p>
faster computer or both could find the number in a reasonable amount of
</p>

<p>
time. Because it is a decision problem the answer is yes.
</p>
</li>

<li>What size of inputs can be computed in a reasonable amount of time?

<p>
Reasonable time is about 6 digit values or 2<sup>n</sup> values.
</p>
</li>

<li>How did you increase the efficiency of the Algorithm?

<p>
We added a lower bound based on the number of digits and the 2<sup>n</sup> value
</p>

<p>
that was just smaller or equal to that number of digits.
</p>

<p>
We pulled calcuations that repeated themselves out of the loop.
</p>

<p>
We also set calc-precision based on our input.
</p>
</li>

<li>What does a string do to the algorithm as opposed to a large integer?

<p>
The string adds complexity to the algorithm by making compare functions
</p>

<p>
have extra loops that then increase the complexity of the algorithm.
</p>

<p>
If the numbers are reasonably small an integer container would be better
</p>

<p>
suited to handle the calculation. As is a string is probably as efficient
</p>

<p>
as is possible for this situation.
</p>
</li>

<li>How does precision affect the calculation?

<p>
The precision of the calculation could determine how long each iteration took
</p>

<p>
which could then add greatly to the amount of time that it took for us
</p>

<p>
to calculate the final answer. The tradeoff was that precision could not
</p>

<p>
be too small or there would be rounding errors. In the end we had to 
</p>

<p>
keep a certain amount of precision that was ballanced in the end.
</p>
</li>
</ol>
</div>
</div>
