vastness.org
** Conclustion

   In conclusion we were able to find a way that we could solve the algorithm

   and were able to see some important aspects of cs306 in the real world. We

   really enjoyed this exploration and that we had the ability to learn more

   about how algorithm study and design could apply to our given field. While

   a lot of code has already been written for many algorithms understanding how 

   they work will give us an advanatage because it will help us know which 

   algorithms are best for a given situation. This exploration helped us to 

   understand that there are always tradeoffs in the algorithms that we design

   and it is important to understand that because we live in a limited world 

   there are always limits to what can be accomplished.

** Source Code


#+BEGIN_SRC emacs-lisp

(defun pow2digits (exp numDigits log10of2)
  (let ((n (calc-eval "$*$$" nil exp log10of2)))
   (calc-eval "floor(10^($ - floor($)) * 10 ^ ($$ - 1))" nil n numDigits)))

(defun findLowerLimit (searchNum)
  (calc-eval "floor(log($)/log(2))" nil searchNum))

(defun search (searchNum)
  (let ((numDigits (length searchNum))
	(lowerBound (string-to-number(findLowerLimit searchNum)))
	(log10of2 (calc-eval "log10(2)")))
    (calc-precision (* numDigits 4))
    (while (not (string= searchNum (pow2digits lowerBound numDigits log10of2)))
      (setq lowerBound (1+ lowerBound)))
    lowerBound))


#+END_SRC
** Vastness Sample Code

  Use the following code block as a guide and a branching point for
  your exploration, if you so desire:

#+BEGIN_SRC emacs-lisp :tangle yes                                                                                                                                     
(require 'bigint) ; find at http://firstthreeodds.org/cs237/bigint.el
(require 'calc)   ; for logarithms and other high precision calculations
(require 'cl)

;; Self-documenting code (except for three functions :-)
;; In other words, the lack of documentation is a deliberate omission
;; to force you to read the code!

(defun fractional-part-of-log-10-of (prefix)
  (let ((log-10-of-prefix (log prefix 10)))
    (- log-10-of-prefix (floor log-10-of-prefix))))

(defconst *log-10-of-2* (log 2 10))

(defun fractional-part-of-n-times-log-10-of-2 (n)
  (let ((n-times-log-10-of-2 (* n *log-10-of-2*)))
    (- n-times-log-10-of-2 (floor n-times-log-10-of-2))))

(defun seek (prefix &optional max-iterations)
  (let ((n 1)
	(lower (fractional-part-of-log-10-of prefix))
	(upper (fractional-part-of-log-10-of (1+ prefix)))
	(sought 0)
	(found nil))
    (setq max-iterations (if (integerp max-iterations) max-iterations most-positive-fixnum))
    (while (and (not found) (< n max-iterations))
      (setq sought (fractional-part-of-n-times-log-10-of-2 n))
;      (princ (format "lower sought upper: %f %f %f\n" lower sought upper))
      (if (and (< lower sought) (< sought upper))
	  (setq found n)
	(setq n (1+ n))))
    found))

(defun verify (found prefix)
  (let* ((calc-display-working-message nil)
	 (power-of-2 (calc-eval (format "2^%d" found))))
    (if	(string= prefix (substring power-of-2 0 (min (length power-of-2) (length prefix))))
	(princ (format "Verified that prefix %s was found by using calc-eval to calculate 2^%d = %s...\n"
		       prefix found (substring power-of-2 0 (min (length power-of-2) 40))))
      (princ (format "Not verified. Try using bc to compute 2^%d\n" found)))))

(defun run (&optional args-string)
  (let* ((args (or args-string (getenv "ARGS")))
	 (arg-list (split-string args " " t))
	 (prefix (nth 0 arg-list))
	 (max-iterations (if (= 2 (length arg-list)) (string-to-number (nth 1 arg-list)) 1000))
	 (found (seek (string-to-number prefix) max-iterations)))
    (if found
	(verify found prefix)
      (princ (format "The prefix %s was not found in %d iterations.\n" prefix max-iterations)))
    t))

(defun calc-log (x)
  "Calculate the natural logarithm of x using a truncated Taylor series expansion.
   This converges (slowly) only for x in the range -1 < x < 1."
  (let ((X (1- x)))
    (+ X (/ (* X X) -2.0) (/ (* X X X) 3.0) (/ (* X X X X) -4.0) (/ (* X X X X X) 5.0)
       (/ (* X X X X X X) -6.0) (/ (* X X X X X X X) 7.0)
       (/ (* X X X X X X X X) -8.0) (/ (* X X X X X X X X X) 9.0))))

(defun calc-log-approx (x)
  "This is actually better than calc-log!"
  (let ((answer x))
    (dotimes (i 10)
      (setq answer (sqrt answer)))
    (* 1024 (1- answer))))

(defvar *one* (bigint-int-to-bigint 1))

(defvar *two* (bigint-int-to-bigint 2))

(defun power-of-2 (n)
  (if (zerop n) *one*
    (let* ((x *one*)
	   (power *two*))
      (while (> n 1)
	(cond ((= 1 (% n 2))
	       (setq x (bigint-multiply x power))
	       (setq n (/ (1- n) 2)))
	      (t
	       (setq n (/ n 2))))
	(setq power (bigint-multiply power power)))
      (bigint-multiply x power))))

(defun power-of-2-string (n-as-string)
  "The string-based version of power-of-2, for convenience.
   Note n-as-string is NOT a bigint-sized number.
   Raising 2 to more than (or even well less than) the
   most-positive-fixnum'th power is NOT recommended."
  (bigint-to-string (power-of-2 (string-to-number n-as-string))))

(defun make-prefix-table (&optional max)
  (let ((max-prefix-size (if max max 10)))
    (make-hash-table :size (* max-prefix-size 1000))))

(defvar *prefix-table* (make-prefix-table))

(defun record-prefix (prefix power-of-2)
  (or (gethash prefix *prefix-table*)
      (puthash prefix power-of-2 *prefix-table*)))

(defun get-prefix-power (prefix)
  (gethash prefix *prefix-table*))

(defun record-each-prefix-in (bigint-as-string n)
  (let ((len (min 10 (length bigint-as-string))))
    (loop for i from 1 to len
	  do (record-prefix (substring bigint-as-string 0 i) n))))

(defun record-prefixes (upper-limit)
  (loop for n from 0 to upper-limit
	do (record-each-prefix-in (bigint-to-string (power-of-2 n)) n)))

(defun display-all ()
  (maphash (lambda (key val) (princ (format "%s --> 2^%d\n" key val))) *prefix-table*))
#+END_SRC

