vastness.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Conclustion</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In conclusion we were able to find a way that we could solve the algorithm
</p>

<p>
and were able to see some important aspects of cs306 in the real world. We
</p>

<p>
really enjoyed this exploration and that we had the ability to learn more
</p>

<p>
about how algorithm study and design could apply to our given field. While
</p>

<p>
a lot of code has already been written for many algorithms understanding how 
</p>

<p>
they work will give us an advanatage because it will help us know which 
</p>

<p>
algorithms are best for a given situation. This exploration helped us to 
</p>

<p>
understand that there are always tradeoffs in the algorithms that we design
</p>

<p>
and it is important to understand that because we live in a limited world 
</p>

<p>
there are always limits to what can be accomplished.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Source Code</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun pow2digits (exp numDigits log10of2)
  (let ((n (calc-eval "$*$$" nil exp log10of2)))
   (calc-eval "floor(10^($ - floor($)) * 10 ^ ($$ - 1))" nil n numDigits)))

(defun findLowerLimit (searchNum)
  (calc-eval "floor(log($)/log(2))" nil searchNum))

(defun search (searchNum)
  (let ((numDigits (length searchNum))
	(lowerBound (string-to-number(findLowerLimit searchNum)))
	(log10of2 (calc-eval "log10(2)")))
    (calc-precision (* numDigits 4))
    (while (not (string= searchNum (pow2digits lowerBound numDigits log10of2)))
      (setq lowerBound (1+ lowerBound)))
    lowerBound))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Vastness Sample Code</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Use the following code block as a guide and a branching point for
your exploration, if you so desire:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'bigint) ; find at http://firstthreeodds.org/cs237/bigint.el
(require 'calc)   ; for logarithms and other high precision calculations
(require 'cl)

;; Self-documenting code (except for three functions :-)
;; In other words, the lack of documentation is a deliberate omission
;; to force you to read the code!

(defun fractional-part-of-log-10-of (prefix)
  (let ((log-10-of-prefix (log prefix 10)))
    (- log-10-of-prefix (floor log-10-of-prefix))))

(defconst *log-10-of-2* (log 2 10))

(defun fractional-part-of-n-times-log-10-of-2 (n)
  (let ((n-times-log-10-of-2 (* n *log-10-of-2*)))
    (- n-times-log-10-of-2 (floor n-times-log-10-of-2))))

(defun seek (prefix &amp;optional max-iterations)
  (let ((n 1)
	(lower (fractional-part-of-log-10-of prefix))
	(upper (fractional-part-of-log-10-of (1+ prefix)))
	(sought 0)
	(found nil))
    (setq max-iterations (if (integerp max-iterations) max-iterations most-positive-fixnum))
    (while (and (not found) (&lt; n max-iterations))
      (setq sought (fractional-part-of-n-times-log-10-of-2 n))
;      (princ (format "lower sought upper: %f %f %f\n" lower sought upper))
      (if (and (&lt; lower sought) (&lt; sought upper))
	  (setq found n)
	(setq n (1+ n))))
    found))

(defun verify (found prefix)
  (let* ((calc-display-working-message nil)
	 (power-of-2 (calc-eval (format "2^%d" found))))
    (if (string= prefix (substring power-of-2 0 (min (length power-of-2) (length prefix))))
	(princ (format "Verified that prefix %s was found by using calc-eval to calculate 2^%d = %s...\n"
		       prefix found (substring power-of-2 0 (min (length power-of-2) 40))))
      (princ (format "Not verified. Try using bc to compute 2^%d\n" found)))))

(defun run (&amp;optional args-string)
  (let* ((args (or args-string (getenv "ARGS")))
	 (arg-list (split-string args " " t))
	 (prefix (nth 0 arg-list))
	 (max-iterations (if (= 2 (length arg-list)) (string-to-number (nth 1 arg-list)) 1000))
	 (found (seek (string-to-number prefix) max-iterations)))
    (if found
	(verify found prefix)
      (princ (format "The prefix %s was not found in %d iterations.\n" prefix max-iterations)))
    t))

(defun calc-log (x)
  "Calculate the natural logarithm of x using a truncated Taylor series expansion.
   This converges (slowly) only for x in the range -1 &lt; x &lt; 1."
  (let ((X (1- x)))
    (+ X (/ (* X X) -2.0) (/ (* X X X) 3.0) (/ (* X X X X) -4.0) (/ (* X X X X X) 5.0)
       (/ (* X X X X X X) -6.0) (/ (* X X X X X X X) 7.0)
       (/ (* X X X X X X X X) -8.0) (/ (* X X X X X X X X X) 9.0))))

(defun calc-log-approx (x)
  "This is actually better than calc-log!"
  (let ((answer x))
    (dotimes (i 10)
      (setq answer (sqrt answer)))
    (* 1024 (1- answer))))

(defvar *one* (bigint-int-to-bigint 1))

(defvar *two* (bigint-int-to-bigint 2))

(defun power-of-2 (n)
  (if (zerop n) *one*
    (let* ((x *one*)
	   (power *two*))
      (while (&gt; n 1)
	(cond ((= 1 (% n 2))
	       (setq x (bigint-multiply x power))
	       (setq n (/ (1- n) 2)))
	      (t
	       (setq n (/ n 2))))
	(setq power (bigint-multiply power power)))
      (bigint-multiply x power))))

(defun power-of-2-string (n-as-string)
  "The string-based version of power-of-2, for convenience.
   Note n-as-string is NOT a bigint-sized number.
   Raising 2 to more than (or even well less than) the
   most-positive-fixnum'th power is NOT recommended."
  (bigint-to-string (power-of-2 (string-to-number n-as-string))))

(defun make-prefix-table (&amp;optional max)
  (let ((max-prefix-size (if max max 10)))
    (make-hash-table :size (* max-prefix-size 1000))))

(defvar *prefix-table* (make-prefix-table))

(defun record-prefix (prefix power-of-2)
  (or (gethash prefix *prefix-table*)
      (puthash prefix power-of-2 *prefix-table*)))

(defun get-prefix-power (prefix)
  (gethash prefix *prefix-table*))

(defun record-each-prefix-in (bigint-as-string n)
  (let ((len (min 10 (length bigint-as-string))))
    (loop for i from 1 to len
	  do (record-prefix (substring bigint-as-string 0 i) n))))

(defun record-prefixes (upper-limit)
  (loop for n from 0 to upper-limit
	do (record-each-prefix-in (bigint-to-string (power-of-2 n)) n)))

(defun display-all ()
  (maphash (lambda (key val) (princ (format "%s --&gt; 2^%d\n" key val))) *prefix-table*))
</pre>
</div>
</div>
</div>
