vastness.org
** What is True?

#+BEGIN_SRC emacs-lisp
(defun what-is-true-about-my-engagement-with-vastness ()
  "If need be, replace a 100 with a smaller number to reflect how much you feel you deserve."
  (vector
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my experience in general?                              ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I learned something new." 100]
["I achieved something meaningful, or something I can build upon at a later time." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my report on what I learned?                            ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["It shows some evidence of a curious mind at work." 100]
["It shows ample evidence of a curious mind at work." 100]
["It shows vast evidence of a curious mind at work." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true about how I justified my answers to the previous question? ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I treated this exploration as a superlative gersy principle application opportunity." 100]
["I enhanced my way of thinking about hard problems." 100]
["I somewhat addressed the first of the partial list of eight questions." 100]
["I thoroughly addressed the first of the partial list of eight questions." 100]
["I *clearly* addressed the first of the partial list of eight questions." 100]
["I somewhat addressed the second of the partial list of eight questions." 100]
["I thoroughly addressed the second of the partial list of eight questions. " 100]
["I *clearly* addressed the second of the partial list of eight questions." 100]
["I somewhat addressed the third of the partial list of eight questions.  " 100]
["I thoroughly addressed the third of the partial list of eight questions." 100]
["I *clearly* addressed the third of the partial list of eight questions." 100]
["I somewhat addressed the fourth of the partial list of eight questions.  " 100]
["I thoroughly addressed the fourth of the partial list of eight questions." 100]
["I *clearly* addressed the fourth of the partial list of eight questions." 100]
["I somewhat addressed the fifth of the partial list of eight questions.  " 100]
["I thoroughly addressed the fifth of the partial list of eight questions." 100]
["I *clearly* addressed the fifth of the partial list of eight questions." 100]
["I somewhat addressed the sixth of the partial list of eight questions.  " 100]
["I thoroughly addressed the sixth of the partial list of eight questions." 100]
["I *clearly* addressed the sixth of the partial list of eight questions." 100]
["I somewhat addressed the seventh of the partial list of eight questions.  " 100]
["I thoroughly addressed the seventh of the partial list of eight questions." 100]
["I *clearly* addressed the seventh of the partial list of eight questions." 100]
["I somewhat addressed the eighth of the partial list of eight questions.  " 100]
["I thoroughly addressed the eighth of the partial list of eight questions." 100]
["I *clearly* addressed the eighth of the partial list of eight questions." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of how I met the creative challenge of coming up           ;;
;; with more questions?                                                    ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I thought of and *clearly* addressed at least two additional questions." 100]
["I thought of and *clearly* addressed at least four additional questions." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of the mechanical "infelicities" (misspelled words,        ;;
;; grammatical errors, punctuation errors) in my report on what I learned? ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["There are fewer than four." 100]
["There are fewer than three." 100]
["There are fewer than two." 100]
["There are none." 100]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true about the efficiency of my code?                           ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["It solves the decision problem in O(infinity) time." 100]
["It solves the decision problem in O(superexponential) time." 100]
["It solves the decision problem in O(exponential) time." 100]
["It solves the decision problem in O(polynomial) time." 100]
["It solves the decision problem in constant time." 100]
))
#+END_SRC
