vastness.html

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">What is True?</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun what-is-true-about-my-engagement-with-vastness ()
  "If need be, replace a 100 with a smaller number to reflect how much you feel you deserve."
  (vector
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my experience in general?                              ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I learned something new." 2]
["I achieved something meaningful, or something I can build upon at a later time." 2]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of my report on what I learned?                            ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["It shows some evidence of a curious mind at work." 3]
["It shows ample evidence of a curious mind at work." 4]
["It shows vast evidence of a curious mind at work." 5]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true about how I justified my answers to the previous question? ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I treated this exploration as a superlative gersy principle application opportunity." 2]
["I enhanced my way of thinking about hard problems." 2]
["I somewhat addressed the first of the partial list of eight questions." 2]
["I thoroughly addressed the first of the partial list of eight questions." 2]
["I *clearly* addressed the first of the partial list of eight questions." 2]
["I somewhat addressed the second of the partial list of eight questions." 2]
["I thoroughly addressed the second of the partial list of eight questions. " 2]
["I *clearly* addressed the second of the partial list of eight questions." 2]
["I somewhat addressed the third of the partial list of eight questions.  " 2]
["I thoroughly addressed the third of the partial list of eight questions." 2]
["I *clearly* addressed the third of the partial list of eight questions." 2]
["I somewhat addressed the fourth of the partial list of eight questions.  " 2]
["I thoroughly addressed the fourth of the partial list of eight questions." 2]
["I *clearly* addressed the fourth of the partial list of eight questions." 2]
["I somewhat addressed the fifth of the partial list of eight questions.  " 2]
["I thoroughly addressed the fifth of the partial list of eight questions." 2]
["I *clearly* addressed the fifth of the partial list of eight questions." 2]
["I somewhat addressed the sixth of the partial list of eight questions.  " 2]
["I thoroughly addressed the sixth of the partial list of eight questions." 2]
["I *clearly* addressed the sixth of the partial list of eight questions." 2]
["I somewhat addressed the seventh of the partial list of eight questions.  " 2]
["I thoroughly addressed the seventh of the partial list of eight questions." 2]
["I *clearly* addressed the seventh of the partial list of eight questions." 2]
["I somewhat addressed the eighth of the partial list of eight questions.  " 2]
["I thoroughly addressed the eighth of the partial list of eight questions." 2]
["I *clearly* addressed the eighth of the partial list of eight questions." 2]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of how I met the creative challenge of coming up           ;;
;; with more questions?                                                    ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["I thought of and *clearly* addressed at least two additional questions." 4]
["I thought of and *clearly* addressed at least four additional questions." 5]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true of the mechanical "infelicities" (misspelled words,        ;;
;; grammatical errors, punctuation errors) in my report on what I learned? ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["There are fewer than four." 2]
["There are fewer than three." 2]
["There are fewer than two." 2]
["There are none." 2]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; What is true about the efficiency of my code?                           ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

["It solves the decision problem in O(infinity) time." 1]
["It solves the decision problem in O(superexponential) time." 2]
["It solves the decision problem in O(exponential) time." 3]
["It solves the decision problem in O(polynomial) time." 4]
["It solves the decision problem in constant time." 5]
))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rick Neff</p>
<p class="date">Created: 2015-12-11 Fri 21:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
